#!/usr/bin/python
# -*- coding: utf-8 -*-
file1 = [{"complain_id":1,"user_line_id":"U51e285d4d47a00d7dcebcc39b599471d","complain_content":"測試","created_on":"2019-10-20T14:41:08.039Z","agree_number":0},{"complain_id":2,"user_line_id":"U95ddf9075f9304ac82b717ac1ca81db4","complain_content":"Hello world","created_on":"2019-10-20T14:50:52.472Z","agree_number":0},{"complain_id":3,"user_line_id":"U95ddf9075f9304ac82b717ac1ca81db4","complain_content":"What time is it?","created_on":"2019-10-20T14:51:09.423Z","agree_number":0},{"complain_id":4,"user_line_id":"U95ddf9075f9304ac82b717ac1ca81db4","complain_content":"What time is it?","created_on":"2019-10-20T14:51:36.846Z","agree_number":0},{"complain_id":5,"user_line_id":"U95ddf9075f9304ac82b717ac1ca81db4","complain_content":"感謝與承擔\n\n就在剛剛，我和陳建仁已經在總統府裡面，正式宣誓就任中華民國第十四任總統與副總統。我們要感謝這塊土地對我們的栽培，感謝人民對我們的信任，以及，最重要的，感謝這個國家的民主機制，讓我們透過和平的選舉過程，實現第三次政黨輪替，並且克服種種不確定因素，順利度過長達四個月的交接期，完成政權和平移轉。\n\n臺灣，再一次用行動告訴世界，作為一群民主人與自由人，我們有堅定的信念，去捍衛民主自由的生活方式。這段旅程，我們每一個人都參與其中。親愛的臺灣人，我們做到了。\n\n我要告訴大家，對於一月十六日的選舉結果，我從來沒有其他的解讀方式。人民選擇了新總統、新政府，所期待的就是四個字：解決問題。此時此刻，臺灣的處境很困難，迫切需要執政者義無反顧的承擔。這一點，我不會忘記。\n\n我也要告訴大家，眼前的種種難關，需要我們誠實面對，需要我們共同承擔。所以，今天的演說是一個邀請，我要邀請全體國人同胞一起來，扛起這個國家的未來。\n\n國家不會因為領導人而偉大；全體國民的共同奮鬥，才讓這個國家偉大。總統團結的不只是支持者，總統該團結的是整個國家。團結是為了改變，這是我對這個國家最深切的期待。在這裡，我要誠懇地呼籲，請給這個國家一個機會，讓我們拋下成見，拋下過去的對立，我們一起來完成新時代交給我們的使命。\n\n在我們共同奮鬥的過程中，身為總統，我要向全國人民宣示，未來我和新政府，將領導這個國家的改革，展現決心，絕不退縮。","created_on":"2019-10-20T15:12:11.691Z","agree_number":0},{"complain_id":6,"user_line_id":"U95ddf9075f9304ac82b717ac1ca81db4","complain_content":"為年輕人打造一個更好的國家\n\n未來的路並不好走，臺灣需要一個正面迎向一切挑戰的新政府，我的責任就是領導這個新政府。\n\n我們的年金制度，如果不改，就會破產。\n\n我們僵化的教育制度，已經逐漸與社會脈動脫節。\n\n我們的能源與資源十分有限，我們的經濟缺乏動能，舊的代工模式已經面臨瓶頸，整個國家極需要新的經濟發展模式。\n\n我們的人口結構急速老化，長照體系卻尚未健全。\n\n我們的人口出生率持續低落，完善的托育制度始終遙遙無期。\n\n我們環境汙染問題仍然嚴重。\n\n我們國家的財政並不樂觀。\n\n我們的司法已經失去人民的信任。\n\n我們的食品安全問題，困擾著所有家庭。\n\n我們的貧富差距越來越嚴重。\n\n我們的社會安全網還有很多破洞。\n\n最重要的，我要特別強調，我們的年輕人處於低薪的處境，他們的人生，動彈不得，對於未來，充滿無奈與茫然。\n\n年輕人的未來是政府的責任。如果不友善的結構沒有改變，再多個人菁英的出現，都不足以讓整體年輕人的處境變好。我期許自己，在未來的任期之內，要一步一步，從根本的結構來解決這個國家的問題。\n\n這就是我想為臺灣的年輕人做的事。雖然我沒有辦法立刻幫所有的年輕人加薪，但是我願意承諾，新政府會立刻展開行動。請給我們一點時間，也請跟我們一起走上改革的這一條路。\n\n改變年輕人的處境，就是改變國家的處境。一個國家的年輕人沒有未來，這個國家必定沒有未來。幫助年輕人突破困境，實現世代正義，把一個更好的國家交到下一個世代手上，就是新政府重大的責任。","created_on":"2019-10-20T15:12:22.308Z","agree_number":0},{"complain_id":7,"user_line_id":"U95ddf9075f9304ac82b717ac1ca81db4","complain_content":"第一、 經濟結構的轉型\n\n要打造一個更好的國家，未來，新政府要做好幾件事。\n\n首先，就是讓臺灣的經濟結構轉型。這是新政府所必須承擔的最艱鉅使命。我們不要妄自菲薄，更不要失去信心。臺灣有很多別的國家沒有的優勢，我們有海洋經濟的活力和靭性、務實可靠的工程師文化、完整的產業鏈、敏捷靈活的中小企業，以及，永不屈服的創業精神。\n\n我們要讓臺灣經濟脫胎換骨，就必須從現在起就下定決心，勇敢地走出另外一條路。這一條路，就是打造臺灣經濟發展的新模式。\n\n新政府將打造一個以創新、就業、分配為核心價值，追求永續發展的新經濟模式。改革的第一步，就是強化經濟的活力與自主性，加強和全球及區域的連結，積極參與多邊及雙邊經濟合作及自由貿易談判，包括TPP、RCEP等，並且，推動新南向政策，提升對外經濟的格局及多元性，告別以往過於依賴單一市場的現象。 \n\n除此之外，新政府相信，唯有激發新的成長動能，我們才能突破當前經濟的停滯不前。我們會以出口和內需作為雙引擎，讓企業生產和人民生活互為表裡，讓對外貿易和在地經濟緊密連結。\n\n我們會優先推動五大創新研發計畫，藉著這些產業來重塑臺灣的全球競爭力。我們也要積極提升勞動生產力，保障勞工權益，讓薪資和經濟成長能同步提升。\n\n這是臺灣經濟發展的關鍵時刻。我們有決心，也有溝通能力。我們已經有系統性的規劃，未來，會以跨部會聯手的模式，把整個國家的力量集結起來，一起來催生這個新模式。\n\n在經濟發展的同時，我們不要忘記對環境的責任。經濟發展的新模式會和國土規劃、區域發展及環境永續，相互結合。產業的佈局和國土的利用，應該拋棄零碎的規畫，和短視近利的眼光。我們必須追求區域的均衡發展，這需要中央來規畫、整合，也需要地方政府充分發揮區域聯合治理的精神。\n\n我們也不能再像過去，無止盡地揮霍自然資源及國民健康。所以，對各種汙染的控制，我們會嚴格把關，更要讓臺灣走向循環經濟的時代，把廢棄物轉換為再生資源。對於能源的選擇，我們會以永續的觀念去逐步調整。新政府會嚴肅看待氣候變遷、國土保育、災害防治的相關議題，因為，我們只有一個地球，我們也只有一個臺灣。","created_on":"2019-10-20T15:12:29.306Z","agree_number":0},{"complain_id":8,"user_line_id":"U95ddf9075f9304ac82b717ac1ca81db4","complain_content":"台灣","created_on":"2019-10-22T07:47:05.053Z","agree_number":0},{"complain_id":9,"user_line_id":"U95ddf9075f9304ac82b717ac1ca81db4","complain_content":"是","created_on":"2019-10-22T07:50:57.614Z","agree_number":0},{"complain_id":10,"user_line_id":"U95ddf9075f9304ac82b717ac1ca81db4","complain_content":"請","created_on":"2019-10-22T07:51:36.369Z","agree_number":0},{"complain_id":11,"user_line_id":"U95ddf9075f9304ac82b717ac1ca81db4","complain_content":"子程好強","created_on":"2019-10-25T12:06:52.316Z","agree_number":0}]

#file1 = soup.find('body')

import jieba
import json
import codecs
import jieba.analyse

print("斷詞中...")
jieba.load_userdict("userdict.txt")
jieba.analyse.set_stop_words("stopword.txt")
hash = {}
for paragraph in file1:
    #print(paragraph["complain_content"])
    seg_list = jieba.analyse.extract_tags(paragraph["complain_content"])#jieba.cut(paragraph["complain_content"],cut_all=False)
    for word in seg_list:
        if word in hash:
            hash[word]+=1
        else:
            hash[word] = 1
            print(word)

json.dump(hash, codecs.open("count.json", 'w', encoding="utf-8"), indent=4, ensure_ascii=False)